; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v6 - type_1 ?v2 - type_2)
 	      (pred_2 ?v4 - object ?v2 - type_2)
	      (pred_3 ?v6 - type_1 ?v7 - type_3)
	      (pred_4 ?v6 - type_1 ?v4 - object ?v7 - type_3))

   (:action op_3
       :parameters  (?v6 - type_1 ?v1 ?v5 - type_2)
       :precondition (and  (pred_1 ?v6 ?v1))
       :effect (and  (pred_1 ?v6 ?v5)
		     (not (pred_1 ?v6 ?v1))))

   (:action op_2
       :parameters (?v6 - type_1 ?v8 - object ?v3 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v3) (pred_1 ?v6 ?v3) (pred_3 ?v6 ?v7))
       :effect (and (pred_4 ?v6 ?v8 ?v7)
		    (not (pred_2 ?v8 ?v3)) 
		    (not (pred_3 ?v6 ?v7))))

   (:action op_1
       :parameters (?v6 - type_1 ?v8 - object ?v3 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v8 ?v7) (pred_1 ?v6 ?v3))
       :effect (and (pred_2 ?v8 ?v3)
		    (pred_3 ?v6 ?v7)
		    (not (pred_4 ?v6 ?v8 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_03 obj_07 - type_1
obj_10 obj_06 obj_02 obj_11 - type_3
obj_12 obj_09 obj_13 obj_01 - type_2
obj_14 obj_08 obj_05 obj_04 - object)
(:init
(pred_1 obj_03 obj_01)
(pred_3 obj_03 obj_10)
(pred_3 obj_03 obj_06)
(pred_1 obj_07 obj_01)
(pred_3 obj_07 obj_02)
(pred_3 obj_07 obj_11)
(pred_2 obj_14 obj_13)
(pred_2 obj_08 obj_09)
(pred_2 obj_05 obj_09)
(pred_2 obj_04 obj_09)
)
(:goal
(and
(pred_2 obj_14 obj_09)
(pred_2 obj_08 obj_13)
(pred_2 obj_05 obj_09)
(pred_2 obj_04 obj_09)
)
)

(:constraints
  (always (not (pred_1 obj_03 obj_13)))
)
)

; plan
1. (op_3 obj_03 obj_01 obj_09)
   deleted: (pred_1 obj_03 obj_01)
   added: (pred_1 obj_03 obj_09)
   goals met: 2 of 4
2. (op_3 obj_07 obj_01 obj_09)
   deleted: (pred_1 obj_07 obj_01)
   added: (pred_1 obj_07 obj_09)
   goals met: 2 of 4
3. (op_2 obj_07 obj_08 obj_09 obj_11)
   deleted: (pred_2 obj_08 obj_09) (pred_3 obj_07 obj_11)
   added: (pred_4 obj_07 obj_08 obj_11)
   goals met: 2 of 4
4. (op_3 obj_07 obj_09 obj_13)
   deleted: (pred_1 obj_07 obj_09)
   added: (pred_1 obj_07 obj_13)
   goals met: 2 of 4
5. (op_1 obj_07 obj_08 obj_13 obj_11)
   deleted: (pred_4 obj_07 obj_08 obj_11)
   added: (pred_2 obj_08 obj_13) (pred_3 obj_07 obj_11)
   goals met: 3 of 4
6. (op_2 obj_07 obj_14 obj_13 obj_11)
   deleted: (pred_2 obj_14 obj_13) (pred_3 obj_07 obj_11)
   added: (pred_4 obj_07 obj_14 obj_11)
   goals met: 3 of 4
7. (op_3 obj_07 obj_13 obj_09)
   deleted: (pred_1 obj_07 obj_13)
   added: (pred_1 obj_07 obj_09)
   goals met: 3 of 4
8. (op_1 obj_07 obj_14 obj_09 obj_11)
   deleted: (pred_4 obj_07 obj_14 obj_11)
   added: (pred_2 obj_14 obj_09) (pred_3 obj_07 obj_11)
   goals met: 4 of 4
